In [2]:
import pandas as pd

In [ ]:
s1 = pd.Series([1,2,3,4,5])  # adds a key for each value.
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
type(s1)

pandas.core.series.Series

In [8]:
a = s1[0]
a

np.int64(1)

In [10]:
s1 = pd.Series([1,2,3,4,5], index = ['a','b','c','d','e'])
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [11]:
s1 = pd.Series({'a': 10, 'b': 20, 'c': 30})
s1

a    10
b    20
c    30
dtype: int64

In [12]:
s1.get('a')

np.int64(10)

In [15]:
s1['a']

np.int64(10)

In [13]:
s1 = pd.Series({'a': 10, 'b': 20, 'c': 30}, index = ['c','x','n','t'])
s1

c    30.0
x     NaN
n     NaN
t     NaN
dtype: float64

In [18]:
s1 = pd.Series({'a': 10, 'b': 20, 'c': 30,'c': 35}, index = ['c','b','b','a'])
s1

c    35
b    20
b    20
a    10
dtype: int64

In [16]:
s1['b'] = 21
s1

c    30
b    21
b    21
a    10
dtype: int64

In [19]:
s1 = pd.Series({'a': 10, 'b': 20, 'c': 30, 'c':31})
s1

a    10
b    20
c    31
dtype: int64

In [21]:
s2 = s1
s2 = s2*3
s2

a    30
b    60
c    93
dtype: int64

In [ ]:
data = pd.DataFrame({'Name': ['Hamad', 'Alex', 'Ali', 'Fatma', ], 'Age': [20,25,30,35]})
data

    Name  Age
0  Hamad   20
1   Alex   25
2    Ali   30
3  Fatma   35

In [30]:
data = pd.DataFrame({'Name': ['Hamad', 'Alex', 'Ali', 'Fatma', ], 'Age': [20,25,30,35],'Address':('Dubai','Ajman','Abu Dhabi','Sharjah')})
data

    Name  Age    Address
0  Hamad   20      Dubai
1   Alex   25      Ajman
2    Ali   30  Abu Dhabi
3  Fatma   35    Sharjah